In [1]:
import pandas as pd
df = pd.read_excel('Data.xlsx')
df.head()

  Company                  Job Degree  Salary_100k
0  Google       Sale Executive     BA            0
1  Google       Sale Executive     MA            0
2  Google     Business Manager     BA            1
3  Google     Business Manager     MA            1
4  Google  Computer Programmer     BA            0

In [2]:
inputs = df.drop('Salary_100k', axis='columns')
inputs.head()

  Company                  Job Degree
0  Google       Sale Executive     BA
1  Google       Sale Executive     MA
2  Google     Business Manager     BA
3  Google     Business Manager     MA
4  Google  Computer Programmer     BA

In [3]:
target= df['Salary_100k']
target.head()

0    0
1    0
2    1
3    1
4    0
Name: Salary_100k, dtype: int64

In [6]:
from sklearn.preprocessing import LabelEncoder
l_model = LabelEncoder()

In [7]:
inputs['Company_n'] = l_model.fit_transform(inputs['Company'])
inputs['Job_n'] = l_model.fit_transform(inputs['Job'])
inputs['Degree_n'] = l_model.fit_transform(inputs['Degree'])
inputs.head()

  Company                  Job Degree  Company_n  Job_n  Degree_n
0  Google       Sale Executive     BA          2      2         0
1  Google       Sale Executive     MA          2      2         1
2  Google     Business Manager     BA          2      0         0
3  Google     Business Manager     MA          2      0         1
4  Google  Computer Programmer     BA          2      1         0

In [8]:
inputs_n = inputs.drop(['Company','Job','Degree'], axis = 'columns')
inputs_n.head()

   Company_n  Job_n  Degree_n
0          2      2         0
1          2      2         1
2          2      0         0
3          2      0         1
4          2      1         0

In [9]:
from sklearn import tree
model = tree.DecisionTreeClassifier()
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [10]:
model.score(inputs_n,target)

1.0

In [12]:
model.predict([[2,2,0]])

/Users/linaalba/opt/anaconda3/lib/python3.9/site-packages/sklearn/base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0])